In [9]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import sidetable

In [10]:
df = pd.read_csv('definitivo_limpieza.csv', index_col = 0)
df.head(2)

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,fatal_(y/n),injury,date,fecha_limpia,fatal_clean,sexo
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,"FATAL, all onboard were killed by sharks",1800,NaN,Y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,FATAL,Reported May-28-1797,May,Y,NaN

1. **Explorar los valores nulos.**

In [11]:
df.stb.missing([df.columns])

              missing  total    percent
time             3340   6284  53.150859
species_         2831   6284  45.050923
age              2820   6284  44.875875
fatal_clean       607   6284   9.659453
sex_              564   6284   8.975175
sexo              564   6284   8.975175
activity          542   6284   8.625080
location          539   6284   8.577339
fatal_(y/n)       534   6284   8.497772
fecha_limpia      526   6284   8.370465
area              454   6284   7.224698
name              209   6284   3.325907
country            50   6284   0.795672
injury             28   6284   0.445576
type                4   6284   0.063654
case_number         1   6284   0.015913

Podemos observar que todas las columnas de nuestro DF tienen algun valor nulo. La mayoria solo tienen menos de un 10% de nulos.

El porcentaje mayor es solo un 52% por lo que todos tienen alguna informaci√≥n que darnos.

2. **Explorad la columna de country y reportad los resultados solo para aquellas categor√≠as que incluyan el 70% de los datos.**

In [15]:
df.stb.freq(['country'], thresh=70)

            country  count    percent  cumulative_count  cumulative_percent
0               USA   2222  35.643247              2222           35.643247
1         AUSTRALIA   1335  21.414822              3557           57.058069
2      SOUTH AFRICA    577   9.255695              4134           66.313763
3  PAPUA NEW GUINEA    134   2.149503              4268           68.463266
4            others   1966  31.536734              6234          100.000000

Esta tabla muestra los cuatro paises que acumulan el 70% de los valores. EL resto de paises aparecer√°n en categor√≠a ***'others'***.

3. **Explorad la columna country en relaci√≥n al sexo, filtrando de nuevo por aquellas categor√≠as que incluyan el 70% de los datos.**

In [18]:
df.stb.freq(["country", 'sexo'], thresh = 70)

,country,sexo,count,percent,cumulative_count,cumulative_percent
0,USA,M,1789,31.529785,1789,31.529785
1,AUSTRALIA,M,1106,19.492422,2895,51.022207
2,SOUTH AFRICA,M,487,8.583010,3382,59.605217
3,USA,F,336,5.921748,3718,65.526965
4,PAPUA NEW GUINEA,M,109,1.921043,3827,67.448008
5,NEW ZEALAND,M,100,1.762425,3927,69.210434
6,others,others,1747,30.789566,5674,100.000000

Hemos agrupado las columnas *'country'* con *'sexo'* teniendo en cuenta esta √∫ltima. Podemos concluir que dentro de estos seis paises que acumulan el 70% de nuestros valores, la mayoria son *'M'* (hombre).

4. **Haced los mismo para la columna activity en relaci√≥n a la columna fatal. En este caso filtrad y mostrad los datos que incluyan el 60% de los datos.**

In [21]:
df.stb.freq(["activity", 'fatal_clean'], thresh = 60)

,activity,fatal_clean,count,percent,cumulative_count,cumulative_percent
0,Surfing,N,876,16.547034,876,16.547034
1,Swimming,N,469,8.859086,1345,25.406120
2,Fishing,N,362,6.837930,1707,32.244050
3,Swimming,Y,303,5.723461,2010,37.967510
4,Spearfishing,N,262,4.948999,2272,42.916509
5,Wading,N,124,2.342274,2396,45.258784
6,Diving,N,90,1.700038,2486,46.958821
7,Standing,N,82,1.548923,2568,48.507745
8,Snorkeling,N,76,1.435587,2644,49.943332
9,Bathing,N,76,1.435587,2720,51.378920
10,Bathing,Y,71,1.341141,2791,52.720060
11,Scuba diving,N,50,0.944465,2841,53.664526
12,Surfing,Y,49,0.925576,2890,54.590102
13,Body boarding,N,47,0.887798,2937,55.477900
14,Fishing,Y,46,0.868908,2983,56.346808
15,Spearfishing,Y,41,0.774462,3024,57.121269
16,Body surfing,N,40,0.755572,3064,57.876842
17,Kayaking,N,30,0.566679,3094,58.443521
18,Fell overboard,Y,26,0.491122,3120,58.934643
19,Treading water,N,23,0.434454,3143,59.369097
20,Boogie boarding,N,23,0.434454,3166,59.803551
21,others,others,2128,40.196449,5294,100.000000

Hemos agrupado las columnas *'activity'* con *'fatal_clean'* teniendo en cuenta esta √∫ltima. Como observamos tenemos muchas categorias diferentes respecto a la columna activity condicionando que el porcentaje acumulado se divida en m√°s filas que en las anteriores tablas(la diferencia entre un porcentaje y el anterior es menor).

5. **Realizad este an√°lisis para la columna fecha en relaci√≥n a la columna fatal. Mostrad solo los resultados para las categor√≠as que incluyan el 60% de los datos.**

In [23]:
df['fecha_limpia'].unique()

array([nan, 'May', 'Sep', 'Jul', 'Aug', 'Dec', 'Mar', 'Oct', 'Apr', 'Jan',
       '500', '214', '336', '493', '725', 'Jun', 'Feb', 'and', 'the',
       'War', 'few', 'Nov', 'Mid', 'day', 'mid', 'Day'], dtype=object)

In [22]:
df.stb.freq(["fecha_limpia", 'fatal_clean'], thresh = 60)

,fecha_limpia,fatal_clean,count,percent,cumulative_count,cumulative_percent
0,Jul,N,471,9.021260,471,9.021260
1,Aug,N,423,8.101896,894,17.123156
2,Sep,N,391,7.488987,1285,24.612143
3,Jun,N,347,6.646236,1632,31.258380
4,Jan,N,344,6.588776,1976,37.847156
5,Oct,N,331,6.339782,2307,44.186937
6,Apr,N,310,5.937560,2617,50.124497
7,Mar,N,290,5.554491,2907,55.678989
8,others,others,2314,44.321011,5221,100.000000

Los valores que representan el 60% respecto a *fecha_limpia*, la *columna fatal_clean*, que se refiere a las muertes por los ataques, es *N* por lo que no falleci√≥ nadie.

**Conclusion.** Debatid entre vosotras qu√© har√≠ais con los valores nulos, ¬ølos quitar√≠ais o los reemplazar√≠ais con un valor que nosotras decidiremos?.

Nuestra decisi√≥n es no eliminar ning√∫n nulo ya que al tener tan poco porcentaje de nulos, asumimos que esos datos nos aportaran informaci√≥n relevante.

In [24]:
df.head()

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,fatal_(y/n),injury,date,fecha_limpia,fatal_clean,sexo
0,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,"FATAL, all onboard were killed by sharks",1800,NaN,Y,F
1,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,FATAL,Reported May-28-1797,May,Y,NaN
2,1792.09.12,1792.0,Provoked,ENGLAND,NaN,On the Thames River,Fishing,male,M,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,"FATAL, PROVOKED INCIDENT",12-Sep-1792,Sep,Y,M
3,1791.00.00,1791.0,Unprovoked,AUSTRALIA,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,Y,"FATAL, ""bitten in two""",1791,NaN,Y,F
4,1788.05.10,1788.0,Boat,AUSTRALIA,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,N,"No injury to occupants, shark bit oar and rudder",10-May-1788,May,N,NaN

Investigamos que tipo de Nan tenemos en las columnas, si son *np.nan* o *strings*, y en el caso de que alguno no coincida con el tipo de dato de la columna, lo cambiariamos al correcto.